In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
data_path = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_df = pd.read_csv(data_path)

# Player Count

In [2]:
players=purchase_df['SN'].unique()
pl=len(players)
print(f'Total Price: {pl}')

Total Price: 576

# Purchasing Analysis

In [3]:
items=purchase_df['Item Name'].unique()
unique_items=len(items)
avg_price=purchase_df['Price'].mean()
n_purchase=len(purchase_df['Price'])
t_revenue=purchase_df['Price'].sum()

In [44]:
pa_df=pd.DataFrame(
        {"Number of Unique Items" : [len(items)],
          "Average Price" : [avg_price],
          "Number of Purchases" : [n_purchase], 
           "Total Revenue" : [t_revenue]})
   
pa_df["Average Price"]=pa_df["Average Price"].map('${:.2f}'.format)
pa_df["Total Revenue"]=pa_df["Total Revenue"].map('${:,.2f}'.format)
pa_df.head()

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

# Gender Demographics

In [54]:
players_gender_df=purchase_df.loc[:,['SN','Age' ,'Gender']]
players_gender_df.drop_duplicates(subset='SN', keep = 'first', inplace = True)
gender_df = pd.DataFrame(players_gender_df['Gender'].value_counts())
gender_df['Percentage of Players']=gender_df['Gender']/gender_df['Gender'].sum()*100
gender_df['Percentage of Players']=gender_df['Percentage of Players'].map('{:.2f}%'.format)
gender_df.rename(columns={'Gender': 'Total Count'}, inplace=True)
gender_df.head()

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

# Purchasing Analysis (Gender)

###   - Male values

In [6]:
male_purchase=purchase_df.loc[purchase_df['Gender']=='Male',:]

#Male purhcase count
mpc=male_purchase['Price'].count()

#male average purchae price
mavp=male_purchase['Price'].mean()

#male total purchase count
mtp=male_purchase['Price'].sum()

#male purchase per person average
pp=male_purchase.loc[:,['SN','Price']]
mpp_df=pd.DataFrame(pp.groupby(by=['SN']).sum())
mpp=mpp_df['Price'].mean()

### - Female values

In [7]:
female_purchase = purchase_df.loc[purchase_df['Gender']=='Female',:]
#female purhcase count
fpc=female_purchase['Price'].count()

#female average purchae price
favp=female_purchase['Price'].mean()

#female total purchase count
ftp=female_purchase['Price'].sum()

#female purchase per person average
pp1=female_purchase.loc[:,['SN','Price']]

fpp_df=pd.DataFrame(pp1.groupby(by=['SN']).sum())
fpp=fpp_df['Price'].mean()

## -Other / Non-Disclosed Values

In [8]:
other_purchase=purchase_df.loc[purchase_df['Gender']=='Other / Non-Disclosed',:]
#other purhcase count
opc=other_purchase['Price'].count()

#other average purchae price
oavp=other_purchase['Price'].mean()

#other total purchase count
otp=other_purchase['Price'].sum()

#other purchase per person average
pp2=other_purchase.loc[:,['SN','Price']]
opp_df=pd.DataFrame(pp2.groupby(by=['SN']).sum())
opp=opp_df['Price'].mean()

In [9]:
# generating purchase analysis (gender) Data Frame
gender_df=pd.DataFrame(
        {"purhcase count" : [mpc ,fpc, opc],
          "average purchae price" : [mavp, favp, oavp],
          "total purchase count" : [mtp, ftp, otp], 
           "purchase per person average" : [mpp, fpp, opp]},
    index = ['Male', 'female', 'other'])
gender_df

,purhcase count,average purchae price,total purchase count,purchase per person average
Male,652,3.017853,1967.64,4.065372
female,113,3.203009,361.94,4.468395
other,15,3.346000,50.19,4.562727

# Age demographics

In [10]:
bins=[0, 9, 14, 19, 24, 29, 34, 39, 100]
age= ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '>40']
players_gender_df['age_range']= pd.cut(players_gender_df["Age"], bins, labels=age, include_lowest=True)
ppa=pd.DataFrame(players_gender_df['age_range'].value_counts(sort=False))
ppa['Percentage of Players']=ppa['age_range']/pl*100

ppa

       age_range  Percentage of Players
<10           17               2.951389
10-14         22               3.819444
15-19        107              18.576389
20-24        258              44.791667
25-29         77              13.368056
30-34         52               9.027778
35-39         31               5.381944
>40           12               2.083333

# Purchasing Analysis (Age)

In [11]:
bins=[0, 9, 14, 19, 24, 29, 34, 39, 100]
age= ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '>40']
purchase_age_df=purchase_df
purchase_age_df['age_range']= pd.cut(purchase_df["Age"], bins, labels=age, include_lowest=True)
purchase_age_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age_range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,>40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [12]:
purchase_count=purchase_age_df['age_range'].value_counts(sort=False).rename_axis('age_range').reset_index(name='a')

purchase_count.columns=['age_range','purchase count']
purchase_count

  age_range  purchase count
0       <10              23
1     10-14              28
2     15-19             136
3     20-24             365
4     25-29             101
5     30-34              73
6     35-39              41
7       >40              13

In [13]:
paa_age=purchase_age_df.groupby('age_range')

In [14]:
avg_pp=paa_age[['Price']].mean()
avg_pp

              Price
age_range
<10        3.353478
10-14      2.956429
15-19      3.035956
20-24      3.052219
25-29      2.900990
30-34      2.931507
35-39      3.601707
>40        2.941538

In [15]:
tot_pv=paa_age[['Price']].sum()
tot_pv

             Price
age_range
<10          77.13
10-14        82.78
15-19       412.89
20-24      1114.06
25-29       293.00
30-34       214.00
35-39       147.67
>40          38.24

In [16]:
ppp_arange=purchase_age_df[['age_range', 'SN', 'Price']]
av_ppp=ppp_arange.groupby(['age_range', 'SN']).sum().reset_index().groupby('age_range').mean()
av_ppp

              Price
age_range
<10        4.537059
10-14      3.762727
15-19      3.858785
20-24      4.318062
25-29      3.805195
30-34      4.115385
35-39      4.763548
>40        3.186667

In [17]:
paa_df=pd.merge(purchase_count,avg_pp, on='age_range')
paa_df=pd.merge(paa_df,tot_pv, on='age_range')
paa_df=pd.merge(paa_df,av_ppp, on='age_range')
paa_df

  age_range  purchase count   Price_x  Price_y     Price
0       <10              23  3.353478    77.13  4.537059
1     10-14              28  2.956429    82.78  3.762727
2     15-19             136  3.035956   412.89  3.858785
3     20-24             365  3.052219  1114.06  4.318062
4     25-29             101  2.900990   293.00  3.805195
5     30-34              73  2.931507   214.00  4.115385
6     35-39              41  3.601707   147.67  4.763548
7       >40              13  2.941538    38.24  3.186667

# Top Spenders

In [18]:
purchase_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age_range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,>40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [19]:
top_sp=pd.DataFrame(purchase_df.loc[:,['SN', 'Price']])
top_sp

                SN  Price
0          Lisim78   3.53
1      Lisovynya38   1.56
2       Ithergue48   4.88
3    Chamassasya86   3.27
4        Iskosia90   1.44
..             ...    ...
775     Aethedru70   3.54
776         Iral74   1.63
777     Yathecal72   3.46
778        Sisur91   4.19
779      Ennrian78   4.60

[780 rows x 2 columns]

In [20]:
pur_count=top_sp['SN'].value_counts().rename_axis('SN').reset_index(name='b')
pur_count.columns=['SN','purchase count']
pur_count

               SN  purchase count
0       Lisosia93               5
1     Idastidru52               4
2          Iral74               4
3        Tyisur83               3
4      Yathecal82               3
..            ...             ...
571  Chanastsda67               1
572   Lisjaskya84               1
573     Ililsan66               1
574    Aethedru70               1
575      Ilassa51               1

[576 rows x 2 columns]

In [21]:
avg_pur_p=top_sp.groupby('SN').mean()
avg_pur_p

                  Price
SN
Adairialis76   2.280000
Adastirin33    4.480000
Aeda94         4.910000
Aela59         4.320000
Aelaria33      1.790000
...                 ...
Yathecal82     2.073333
Yathedeu43     3.010000
Yoishirrala98  4.580000
Zhisrisu83     3.945000
Zontibe81      2.676667

[576 rows x 1 columns]

In [22]:
top_spender_df=pd.merge(pur_count,avg_pur_p, on='SN')
top_spender_df

               SN  purchase count     Price
0       Lisosia93               5  3.792000
1     Idastidru52               4  3.862500
2          Iral74               4  3.405000
3        Tyisur83               3  1.786667
4      Yathecal82               3  2.073333
..            ...             ...       ...
571  Chanastsda67               1  3.700000
572   Lisjaskya84               1  2.890000
573     Ililsan66               1  2.850000
574    Aethedru70               1  3.540000
575      Ilassa51               1  2.220000

[576 rows x 3 columns]

In [23]:
tot_pur_p=top_sp.groupby('SN').sum()
tot_pur_p

               Price
SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
...              ...
Yathecal82      6.22
Yathedeu43      6.02
Yoishirrala98   4.58
Zhisrisu83      7.89
Zontibe81       8.03

[576 rows x 1 columns]

In [24]:
top_spender_df=pd.merge(top_spender_df,tot_pur_p, on='SN')
top_spender_df

               SN  purchase count   Price_x  Price_y
0       Lisosia93               5  3.792000    18.96
1     Idastidru52               4  3.862500    15.45
2          Iral74               4  3.405000    13.62
3        Tyisur83               3  1.786667     5.36
4      Yathecal82               3  2.073333     6.22
..            ...             ...       ...      ...
571  Chanastsda67               1  3.700000     3.70
572   Lisjaskya84               1  2.890000     2.89
573     Ililsan66               1  2.850000     2.85
574    Aethedru70               1  3.540000     3.54
575      Ilassa51               1  2.220000     2.22

[576 rows x 4 columns]

In [25]:
top_spender_sorted=top_spender_df.sort_values(by=['Price_y'],ascending=False)
top_spender_sorted

              SN  purchase count   Price_x  Price_y
0      Lisosia93               5  3.792000    18.96
1    Idastidru52               4  3.862500    15.45
26    Chamjask73               3  4.610000    13.83
2         Iral74               4  3.405000    13.62
20   Iskadarya95               3  4.366667    13.10
..           ...             ...       ...      ...
308       Hala31               1  1.020000     1.02
207  Qilalista41               1  1.020000     1.02
317      Aidai61               1  1.010000     1.01
486   Chanirra79               1  1.010000     1.01
324        Alo38               1  1.000000     1.00

[576 rows x 4 columns]

# Most Popular Items

In [26]:
most_popular=pd.DataFrame(purchase_df.loc[:,['Item ID','Item Name', 'Price']])
most_popular

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [27]:
item_pur_count=most_popular['Item ID'].value_counts().rename_axis('Item ID').reset_index(name='a')
item_pur_count.columns=['Item ID','purchase count']
item_pur_count

     Item ID  purchase count
0         92              13
1        178              12
2        108               9
3        132               9
4         82               9
..       ...             ...
174      104               1
175       27               1
176      134               1
177      118               1
178       91               1

[179 rows x 2 columns]

In [28]:
mp_item_price=most_popular.groupby(['Item ID','Item Name']).mean().reset_index()
mp_item_price

     Item ID                                     Item Name   Price
0          0                                      Splinter  1.2800
1          1                                      Crucifer  2.9425
2          2                                       Verdict  2.4800
3          3                                  Phantomlight  2.4900
4          4                            Bloodlord's Fetish  1.7000
..       ...                                           ...     ...
174      178  Oathbreaker, Last Hope of the Breaking Storm  4.2300
175      179               Wolf, Promise of the Moonwalker  4.4800
176      181                                 Reaper's Toll  1.6600
177      182                                     Toothpick  4.0300
178      183                           Dragon's Greatsword  1.0900

[179 rows x 3 columns]

In [29]:
mp_item_pvalue=most_popular.groupby(['Item ID','Item Name']).sum().reset_index()
mp_item_pvalue

     Item ID                                     Item Name  Price
0          0                                      Splinter   5.12
1          1                                      Crucifer  11.77
2          2                                       Verdict  14.88
3          3                                  Phantomlight  14.94
4          4                            Bloodlord's Fetish   8.50
..       ...                                           ...    ...
174      178  Oathbreaker, Last Hope of the Breaking Storm  50.76
175      179               Wolf, Promise of the Moonwalker  26.88
176      181                                 Reaper's Toll   8.30
177      182                                     Toothpick  12.09
178      183                           Dragon's Greatsword   3.27

[179 rows x 3 columns]

In [34]:
mpi=pd.merge(mp_item_price,item_pur_count, on='Item ID')
mpi=pd.merge(mpi,mp_item_pvalue, on='Item ID')
mpi

,Item ID,Item Name_x,Price_x,purchase count,Item Name_y,Price_y
0,0,Splinter,1.2800,4,Splinter,5.12
1,1,Crucifer,2.9425,4,Crucifer,11.77
2,2,Verdict,2.4800,6,Verdict,14.88
3,3,Phantomlight,2.4900,6,Phantomlight,14.94
4,4,Bloodlord's Fetish,1.7000,5,Bloodlord's Fetish,8.50
...,...,...,...,...,...,...
174,178,"Oathbreaker, Last Hope of the Breaking Storm",4.2300,12,"Oathbreaker, Last Hope of the Breaking Storm",50.76
175,179,"Wolf, Promise of the Moonwalker",4.4800,6,"Wolf, Promise of the Moonwalker",26.88
176,181,Reaper's Toll,1.6600,5,Reaper's Toll,8.30
177,182,Toothpick,4.0300,3,Toothpick,12.09
178,183,Dragon's Greatsword,1.0900,3,Dragon's Greatsword,3.27

In [35]:
mpi.drop(['Item Name_y'], axis=1)
mpi

,Item ID,Item Name_x,Price_x,purchase count,Item Name_y,Price_y
0,0,Splinter,1.2800,4,Splinter,5.12
1,1,Crucifer,2.9425,4,Crucifer,11.77
2,2,Verdict,2.4800,6,Verdict,14.88
3,3,Phantomlight,2.4900,6,Phantomlight,14.94
4,4,Bloodlord's Fetish,1.7000,5,Bloodlord's Fetish,8.50
...,...,...,...,...,...,...
174,178,"Oathbreaker, Last Hope of the Breaking Storm",4.2300,12,"Oathbreaker, Last Hope of the Breaking Storm",50.76
175,179,"Wolf, Promise of the Moonwalker",4.4800,6,"Wolf, Promise of the Moonwalker",26.88
176,181,Reaper's Toll,1.6600,5,Reaper's Toll,8.30
177,182,Toothpick,4.0300,3,Toothpick,12.09
178,183,Dragon's Greatsword,1.0900,3,Dragon's Greatsword,3.27

In [38]:
mpi=mpi[['Item ID' , 'Item Name_x', 'purchase count', 'Price_x', 'Price_y' ]]
mpi.sort_values(by=['purchase count'],ascending=False)

,Item ID,Item Name_x,purchase count,Price_x,Price_y
90,92,Final Critic,13,4.614615,59.99
174,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
141,145,Fiery Glass Crusader,9,4.580000,41.22
129,132,Persuasion,9,3.221111,28.99
105,108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77
...,...,...,...,...,...
40,42,The Decapitator,1,1.750000,1.75
49,51,Endbringer,1,4.660000,4.66
115,118,"Ghost Reaver, Longsword of Magic",1,2.170000,2.17
101,104,Gladiator's Glaive,1,1.930000,1.93
89,91,Celeste,1,4.170000,4.17

In [39]:
mpi.sort_values(by=['Price_y'],ascending=False)

,Item ID,Item Name_x,purchase count,Price_x,Price_y
90,92,Final Critic,13,4.614615,59.99
174,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
80,82,Nirvana,9,4.900000,44.10
141,145,Fiery Glass Crusader,9,4.580000,41.22
100,103,Singed Scalpel,8,4.350000,34.80
...,...,...,...,...,...
27,28,"Flux, Destroyer of Due Diligence",2,1.060000,2.12
122,125,Whistling Mithril Warblade,2,1.000000,2.00
123,126,Exiled Mithril Longsword,1,2.000000,2.00
101,104,Gladiator's Glaive,1,1.930000,1.93
40,42,The Decapitator,1,1.750000,1.75